Tekla.Structures.Analysis.AnalysisRestraintData
The AnalysisRestraintData class contains the restraint data for an
analysis part.

Tekla.Structures.Analysis.AnalysisRestraintData._ReleaseType
Release type.

Tekla.Structures.Analysis.AnalysisRestraintData._UxType
Restraint type for Ux.

Tekla.Structures.Analysis.AnalysisRestraintData._UyType
Restraint type for Uy.

Tekla.Structures.Analysis.AnalysisRestraintData._UzType
Restraint type for Uz.

Tekla.Structures.Analysis.AnalysisRestraintData._RxType
Restraint type for  Rx.

Tekla.Structures.Analysis.AnalysisRestraintData._RyType
Restraint type for Ry.

Tekla.Structures.Analysis.AnalysisRestraintData._RzType
Restraint type for Rz.

Tekla.Structures.Analysis.AnalysisRestraintData._UxSpring
Ux [N/mm].

Tekla.Structures.Analysis.AnalysisRestraintData._UySpring
Uy [N/mm].

Tekla.Structures.Analysis.AnalysisRestraintData._UzSpring
Uz [N/mm].

Tekla.Structures.Analysis.AnalysisRestraintData._RxSpring
Rx [Nmm/rad].

Tekla.Structures.Analysis.AnalysisRestraintData._RySpring
Ry [Nmm/rad].

Tekla.Structures.Analysis.AnalysisRestraintData._RzSpring
Rz [Nmm/rad].

Tekla.Structures.Analysis.AnalysisRestraintData._Supported
Supported.

Tekla.Structures.Analysis.AnalysisRestraintData._LocalCoordinateSystem
Loca coordinate system.

Tekla.Structures.Analysis.AnalysisRestraintData.#ctor
Creates a new instance of an analysis restraint data.

Tekla.Structures.Analysis.AnalysisRestraintData.ReleaseType
The release type.

Tekla.Structures.Analysis.AnalysisRestraintData.UxType
The restraint type for the displacement in the X-axis direction.

Tekla.Structures.Analysis.AnalysisRestraintData.UyType
The restraint type for the displacement in the Y-axis direction.

Tekla.Structures.Analysis.AnalysisRestraintData.UzType
The restraint type for the displacement in the Z-axis direction.

Tekla.Structures.Analysis.AnalysisRestraintData.RxType
The restraint type for the rotation in the X-axis direction.

Tekla.Structures.Analysis.AnalysisRestraintData.RyType
The restraint type for the rotation in the Y-axis direction.

Tekla.Structures.Analysis.AnalysisRestraintData.RzType
The restraint type for the rotation in the Z-axis direction.

Tekla.Structures.Analysis.AnalysisRestraintData.UxSpring
The displacement in the X-axis direction (N/mm).

Tekla.Structures.Analysis.AnalysisRestraintData.UySpring
The displacement in the Y-axis direction (N/mm).

Tekla.Structures.Analysis.AnalysisRestraintData.UzSpring
The displacement in the Z-axis direction (N/mm).

Tekla.Structures.Analysis.AnalysisRestraintData.RxSpring
The rotation in the X-axis direction (Nmm/rad).

Tekla.Structures.Analysis.AnalysisRestraintData.RySpring
The rotation in the Y-axis direction (Nmm/rad).

Tekla.Structures.Analysis.AnalysisRestraintData.RzSpring
The rotation in the Z-axis direction (Nmm/rad).

Tekla.Structures.Analysis.AnalysisRestraintData.Supported
The support condition.

Tekla.Structures.Analysis.AnalysisRestraintData.LocalCoordinateSystem
The local coordinate system.